[
  {
    "id": 1,
    "name": "Jennifer R.",
    "pet": "Jaxx",
    "rating": 5,
    "date": "Oct 26, 2025",
    "text": "Jaxx loved his day stay. She communicated fast and quick.",
    "service": "Doggy Day Care"
  },
  {
    "id": 2,
    "name": "Amber D.",
    "pet": "Moose",
    "rating": 5,
    "date": "Oct 21, 2025",
    "text": "Trudy was great! I would most definitely trust her with watching my guy Moose again. We had an initial meet and greet to make sure we thought it would be a good fit and to see how the dogs got along, which was great. It made me feel comfortable with where he would be and what his stay would be like. She was timely in communication and overall took great care of him.",
    "service": "Boarding"
  },
  {
    "id": 3,
    "name": "Lisette H.",
    "pet": "Breeze",
    "rating": 5,
    "date": "Sep 29, 2025",
    "text": "Trudy is so sweet, flexible and knowledgeable. She treats dogs like her own! I felt at ease on my trip and didn’t have to worry about anything.",
    "service": "Boarding"
  },
  {
    "id": 4,
    "name": "Ryan D.",
    "pet": "Dakota",
    "rating": 5,
    "date": "Sep 18, 2025",
    "text": "Our pups had yet another amazing vacation with Trudy and her family. Always a great experience.",
    "service": "Boarding"
  },
  {
    "id": 5,
    "name": "Carrie R.",
    "pet": "Stevie",
    "rating": 5,
    "date": "Sep 16, 2025",
    "text": "Trudy is awesome!! So thankful for her and for opening her wonderful home to our pup! He was treated like their own! Nothing better than knowing your pup is comfortable in someone else’s home while you’re away! I highly recommend her and appreciate her hospitality! We will definitely be using her again and again!! :)",
    "service": "Boarding"
  },
  {
    "id": 6,
    "name": "Jess P.",
    "pet": "Knyte",
    "rating": 5,
    "date": "Sep 15, 2025",
    "text": "Trudy is so kind and made Knyte feel right at home, she updated us with photos, texts and videos and made us feel reassured that our fur baby was doing well.",
    "service": "Boarding"
  },
  {
    "id": 7,
    "name": "Yvonne M.",
    "pet": "Brownie",
    "rating": 5,
    "date": "Sep 09, 2025",
    "text": "Trudy has been a Godsend! I had a family emergency and needed to leave without notice and she was so accommodating. She’s been loving on my Brownie baby and he’s been Soo happy in the multiple picture I’ve received. And when I had to stay later, she stepped up and said it would be no problem to care for my fur Baby. She came through for me. Very kind, great listener to my baby’s needs. I highly recommend Trudy.",
    "service": "Boarding"
  },
  {
    "id": 8,
    "name": "Bethany D.",
    "pet": "Raya",
    "rating": 5,
    "date": "Aug 11, 2025",
    "text": "Trudy is amazing! From the first contact to pick-up she was so responsive and helpful. She sent video and picture updates daily and I felt so good knowing that my dog was well cared for and having fun. My dog Raya had a wonderful time staying with Trudy and I will definitely book with her again!",
    "service": "Boarding"
  },
  {
    "id": 9,
    "name": "Gerrit B.",
    "pet": "Barley",
    "rating": 5,
    "date": "Aug 11, 2025",
    "text": "Trudy took great care of Barley and was even accommodating when we were delayed on our travel back home!",
    "service": "Boarding"
  },
  {
    "id": 10,
    "name": "Irene E.",
    "pet": "Elliiee",
    "rating": 5,
    "date": "Aug 06, 2025",
    "text": "Absolutely phenomenal. Very caring, friendly, and thoughtful to send pictures and up to date status of how Elliiee was doing on her first time trip away from home.",
    "service": "Boarding"
  }
]
