[
  {
    "id": 1,
    "name": "Jennifer R.",
    "pet": "Jaxx",
    "rating": 5,
    "date": "Oct 26, 2025",
    "text": "Jaxx loved his day stay. She communicated fast and quick.",
    "service": "Doggy Day Care"
  },
  {
    "id": 2,
    "name": "Amber D.",
    "pet": "Moose",
    "rating": 5,
    "date": "Oct 21, 2025",
    "text": "Trudy was great! I would most definitely trust her with watching my guy Moose again. We had an initial meet and greet to make sure we thought it would be a good fit and to see how the dogs got along, which was great. It made me feel comfortable with where he would be and what his stay would be like. She was timely in communication and overall took great care of him.",
    "service": "Boarding"
  },
  {
    "id": 3,
    "name": "Lisette H.",
    "pet": "Breeze",
    "rating": 5,
    "date": "Sep 29, 2025",
    "text": "Trudy is so sweet, flexible and knowledgeable. She treats dogs like her own! I felt at ease on my trip and didn’t have to worry about anything.",
    "service": "Boarding"
  },
  {
    "id": 4,
    "name": "Ryan D.",
    "pet": "Dakota",
    "rating": 5,
    "date": "Sep 18, 2025",
    "text": "Our pups had yet another amazing vacation with Trudy and her family. Always a great experience.",
    "service": "Boarding"
  },
  {
    "id": 5,
    "name": "Carrie R.",
    "pet": "Stevie",
    "rating": 5,
    "date": "Sep 16, 2025",
    "text": "Trudy is awesome!! So thankful for her and for opening her wonderful home to our pup! He was treated like their own! Nothing better than knowing your pup is comfortable in someone else’s home while you’re away! I highly recommend her and appreciate her hospitality! We will definitely be using her again and again!! :)",
    "service": "Boarding"
  },
  {
    "id": 6,
    "name": "Jess P.",
    "pet": "Knyte",
    "rating": 5,
    "date": "Sep 15, 2025",
    "text": "Trudy is so kind and made Knyte feel right at home, she updated us with photos, texts and videos and made us feel reassured that our fur baby was doing well.",
    "service": "Boarding"
  },
  {
    "id": 7,
    "name": "Yvonne M.",
    "pet": "Brownie",
    "rating": 5,
    "date": "Sep 09, 2025",
    "text": "Trudy has been a Godsend! I had a family emergency and needed to leave without notice and she was so accommodating. She’s been loving on my Brownie baby and he’s been Soo happy in the multiple picture I’ve received. And when I had to stay later, she stepped up and said it would be no problem to care for my fur Baby. She came through for me. Very kind, great listener to my baby’s needs. I highly recommend Trudy.",
    "service": "Boarding"
  },
  {
    "id": 8,
    "name": "Bethany D.",
    "pet": "Raya",
    "rating": 5,
    "date": "Aug 11, 2025",
    "text": "Trudy is amazing! From the first contact to pick-up she was so responsive and helpful. She sent video and picture updates daily and I felt so good knowing that my dog was well cared for and having fun. My dog Raya had a wonderful time staying with Trudy and I will definitely book with her again!",
    "service": "Boarding"
  },
  {
    "id": 9,
    "name": "Gerrit B.",
    "pet": "Barley",
    "rating": 5,
    "date": "Aug 11, 2025",
    "text": "Trudy took great care of Barley and was even accommodating when we were delayed on our travel back home!",
    "service": "Boarding"
  },
  {
    "id": 10,
    "name": "Irene E.",
    "pet": "Elliiee",
    "rating": 5,
    "date": "Aug 06, 2025",
    "text": "Absolutely phenomenal. Very caring, friendly, and thoughtful to send pictures and up to date status of how Elliiee was doing on her first time trip away from home.",
    "service": "Boarding"
  },
  {
    "id": 11,
    "name": "Chad G.",
    "pet": "Jake",
    "rating": 5,
    "date": "Jul 27, 2025",
    "text": "Trudy was great. She watched my young Labrador Jake for 9 days and checked in with pictures regularly. I think he was treated like family and had lots of play time with other furry friends. I definitely recommend her.",
    "service": "Boarding"
  },
  {
    "id": 12,
    "name": "Amber S.",
    "pet": "Sunny",
    "rating": 5,
    "date": "Jul 27, 2025",
    "text": "Trudy was fantastic! Easy booking process. She sent regular updates and photos throughout the stay. Our girl was on her own vacation while we were away. I would highly recommend Trudy and plan to use her in the future.",
    "service": "Boarding"
  },
  {
    "id": 13,
    "name": "Ashley P.",
    "pet": "Kane",
    "rating": 5,
    "date": "Jul 26, 2025",
    "text": "Trudy was absolutely wonderful and so easy to setup with her, very responsive, even sent pics during our dog's week-long stay. We did a meet and greet beforehand. Drop off and pickup was easy. I’ve never left our dog with anyone before and would definitely use her again and highly recommend as well!",
    "service": "Boarding"
  },
  {
    "id": 14,
    "name": "Doug P.",
    "pet": "Ranger",
    "rating": 5,
    "date": "Jul 15, 2025",
    "text": "It was great getting pictures and updates and Trudy was extremely nice to work with. She made Ranger feel at home.",
    "service": "Boarding"
  },
  {
    "id": 15,
    "name": "Kari M.",
    "pet": "Piper",
    "rating": 5,
    "date": "Jul 09, 2025",
    "text": "Trudy was amazing and our dog seemed to have a great time! Our initial dog sitter plans fell through so we needed to find another plan quickly and it was over the holiday weekend! Trudy was so accommodating in figuring out our dropoff/pickup timing and was extra attentive to our dog’s fear of fireworks. We definitely hope to have her watch our dog again on our next vacation!",
    "service": "Boarding"
  },
  {
    "id": 16,
    "name": "Lauren Z.",
    "pet": "Dolly",
    "rating": 5,
    "date": "Jul 09, 2025",
    "text": "Trudy is an amazing sitter. She is very communicative and shows she cares deeply for the pups under her care. We will definitely continue to book with her in the future. Highly recommend!",
    "service": "Boarding"
  },
  {
    "id": 17,
    "name": "Ryan D.",
    "pet": "Dakota",
    "rating": 5,
    "date": "Jul 08, 2025",
    "text": "We had a last minute trip come up, and needed a new place to board our almost 2 year old lab. We did a meet and greet with Trudy and she was phenomenal right off the bat. Dakota felt very at home and safe immediately. She took extra care of him during the holiday fireworks. Upon pick up, he was so happy he barely wanted to leave! Definitely recommend Trudy.",
    "service": "Boarding"
  },
  {
    "id": 18,
    "name": "Darli B.",
    "pet": "Lady",
    "rating": 5,
    "date": "Jun 10, 2025",
    "text": "What a pleasure it is to provide a wonderful review for Trudy. She has watched my Golden Retriever Lady, our cockatiels, and our cat. She is kind, gentle, patient, reliable, and truly loves animals."
  },
  {
    "id": 19,
    "name": "Jessica S.",
    "pet": "Guest Pup",
    "rating": 5,
    "date": "Jun 10, 2025",
    "text": "I have known Trudy for over 25 years. She has always had loving pets and treats animals like family. My dogs adore her and wait by the door when she visits. I highly recommend her as a pet caregiver."
  },
  {
    "id": 20,
    "name": "Erica F.",
    "pet": "Guest Pup",
    "rating": 5,
    "date": "Jun 10, 2025",
    "text": "I have two rambunctious dogs who adore their 'Aunt Trudy.' She gives them love, attention, and patience. I trust her completely with my pups, and she never minds the fur or slobber — she just loves dogs that much!"
  }
]