[
  {
    "client_name": "LONG LA",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-15",
    "text": "Ruh-Roh Retreat took such great care of my pup! The home was calm, clean, and safe, and I felt comfortable right away. Johnny was very professional and gave me total peace of mind while I was away by sending daily photo and video updates. My dog came back happy, relaxed, and clearly well cared for. I’ll definitely be booking again and recommend Ruh-Roh Retreat to anyone looking for quality care.",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "William Boscacci",
    "pet_name": "",
    "rating": 5,
    "date": "2025-10-15",
    "text": "We had a great experience with Johnny! He was prompt, incredibly organized, and made everything easy from the start. The meet and greet was warm and professional, and it was clear he genuinely loves dogs! Throughout the stay, he sent regular pictures and videos, which gave us real peace of mind. Our pup was happy and well cared for the entire time. You can tell Johnny makes your dog a true priority. We highly recommend Johnny and are so glad we found him.",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Joann Lim",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-25",
    "text": "We have stayed with Johnny twice already! Johnny is caring and loving and our pups always have a great time with him. He is professional, reliable and responsible. He definitely takes the pet sitting seriously so you know your pups are in good hands and are well taken care of. We are so glad we found Johnny and will be always be staying with him! Also, my pups smell amazing every time 😄",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Belia Villegas",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-28",
    "text": "Our golden doodle, Xotchil, absolutely loves her vacation time with Johnny! He's the only person I feel completely comfortable leaving her with. Johnny isn't just responsible, he genuinely loves caring for dogs. He always goes above and beyond, whether it's taking them on fun walks, giving them plenty of playtime, or making sure they feel at home. What I appreciate most is the special attention he gives to each dog, treating them like his own. I can tell Xotchil feels safe, happy, and loved when she's with him. I 100% recommend Johnny to anyone looking for a trustworthy, caring, and dedicated dog sitter. Your pup will be in the best hands!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Brianne Lumley",
    "pet_name": "",
    "rating": 5,
    "date": "2025-10-20",
    "text": "100% recommend!!! Johnny was so sweet and caring with my older dachshund. My boy is nervous around other dogs normally and super clingy. Johnny took care of him like he was his own dog and was super communicative sending cute pics and updates.",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Diante M",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-20",
    "text": "We had an amazing experience with Jonathan pet sitting BMO and Reeses! We met in person with the pups prior to dropping the dog’s off for their stay and he gave us a run down on what to expect during their time with him. We recently moved to Orange County and needed to find someone reliable and knowledgeable that we trust with our fur-babies, and Jonathan is now our guy! He kept us updated daily on the dogs and was a great communicator. We were at ease and felt confident that we could unplug and enjoy our vacation knowing they were in excellent hands. We will definitely be back and would recommend Ruh-Roh Retreat to anyone in the area that needs a dog sitter. Thank you so much for a great experience!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Martha Peric",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-20",
    "text": "We couldn’t be happier with our experience with Johnny. From the very first meet and greet, it was obvious how much he genuinely cares for the dogs he hosts. Our pup can be a little anxious in new environments, but she settled in with him almost immediately — which has never happened before. We got daily updates with photos and videos, and it was clear she was relaxed, happy, and treated like part of the family. Johnny keeps a calm, clean home and only takes a small number of dogs, which made such a huge difference. It never felt chaotic or overcrowded like other places we’ve tried. What stood out the most was the structure and attention he gives each dog. You can tell he really understands dog behavior and takes the time to make sure every pup feels safe and included. We felt completely at ease throughout our entire trip, which is priceless as a pet parent. If you’re looking for someone who will care for your dog with patience, kindness, and true professionalism, Johnny is the one. Our girl can’t wait to go back for her next stay. Highly, highly recommend!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Daniëlle van der Steen",
    "pet_name": "",
    "rating": 5,
    "date": "2025-10-04",
    "text": "We are so happy we found Jonathan as a dog sitter for our Rhodesian. Not everyone is fit for a larger/stronger dog but these 2 are a perfect match from the start. Max had the best time in Johnnys care with his new friends and I will call Johnny without any doubt as soon as we’re in need of someone who can watch Max. Definitely 100% recommending Johnny!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Jennifer Bui-Adams",
    "pet_name": "",
    "rating": 5,
    "date": "2025-10-04",
    "text": "10/10 would recommend Johnny!! He’s super friendly and communicative. We were skeptical we’d find someone who can watch our dog since he’s a big, 100lb puppy so wanted to make sure he was in good hands. Since doing a meet and greet with Johnny, we knew he’d take great care of Maverick!! Our pup is a little stubborn and has some anxiety at first when we drop him off, but Johnny worked with him to make him feel comfortable and provided us with ample updates via text, photos and videos! Mavericks now stayed with Johnny a few times and we have the utmost confidence he’s having a blast and enjoying his stay every time!!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Sharon Christian",
    "pet_name": "",
    "rating": 5,
    "date": "2025-10-04",
    "text": "after a warm meet & greet weeks before, our doodle spent a fun trial overnight at the immaculate property. our young pup came home better trained & enjoyed playing with other dogs. jonathan closely monitored their interactions to make sure everyone was safe & happy. he sent many updates with pics & videos. we’re thrilled to have a loving, attentive place to board our dog now. looking forward to a great long-term partnership, jonathan!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Erica Marshall",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-28",
    "text": "Johnny did an amazing job caring for our senior pug. He was patient, loving and customized her care to her specific needs. I felt relaxed while away knowing she was being well cared for. I received regular updates that gave me confirmation I had chosen well when I chose Johnny to take care of my sweet girl. Most importantly, my dog was very relaxed from the moment she first met Johnny and that never seemed to change. 10/10 recommend him and will be using him again in the future!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Nicholas Sulier",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-13",
    "text": "Johnny has quickly become my go-to sitter for this area. Wonderful with my dog Leo and super reliable! Would definitely recommend to everyone out there.",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Chau Tran",
    "pet_name": "",
    "rating": 5,
    "date": "2025-10-04",
    "text": "Johnny was truly an amazing find. I was so hesitant to leave my dog with anyone outside of family — especially since my dog is diabetic and needs insulin shots twice a day. This was my very first time booking a sitter, and I was so nervous. From the very beginning, Johnny put me at ease. He asked the right questions, explained how he keeps dogs safe in his home, and really took the time to understand my pup’s needs. During the stay, he gave my dog her injections right on schedule, took her on walks, and sent me frequent updates with pictures and videos so I could see how she was doing. What stood out the most is that Johnny genuinely has a heart of gold when it comes to dogs. He wasn’t just doing a job — he cared for my pup as if she were his own. That kind of love and attention is rare, and it made all the difference for me. I can’t thank him enough for giving me peace of mind and making this first experience such a positive one. 10/10 would recommend him to anyone who needs a sitter!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Anderson Hinsch",
    "pet_name": "",
    "rating": 5,
    "date": "2025-10-04",
    "text": "Johnny is the best! So nice to have a home away from home for our Bull Terrier, Goose. Johnny provides updates and pictures throughout the stay. We’ve used him a few times and Goose is always excited to go back to play with his friends and Johnny!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Abraham olivo",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-04",
    "text": "My girlfriend and I have been searching for the perfect person to watch our cattle dog on the busiest days - Jonathan is it! He has taken care of our pup on multiple occasions (including overnight) and we can't recommend him enough! We love how excited Mooky gets when she sees him, that he keeps us updated with photos and videos, and always makes sure our girl is comfortable/well taken care of. Will continue to come back.",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Kelsi Calvillo",
    "pet_name": "",
    "rating": 5,
    "date": "2025-10-04",
    "text": "We boarded our dog for 8 days with Johnny and had a great experience. He sent picture and video updates every day, and he treated Rocco like his own. We will definitely be boarding with Ruh-Roh for our next vacation.",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Brenda Salazar",
    "pet_name": "",
    "rating": 5,
    "date": "2025-10-04",
    "text": "Thank you for making us feel so comfortable and confident with leaving our fur baby max under your care. Most importantly we thank you for showing us that your home is a safe place for Max. I appreciate the daily updates, the quick replies to our messages and overall giving us the best experience during our travels away from our baby Max. I highly recommend your services and we will be booking again soon. Thank you so much Jonathan, we appreciate you!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Jennifer Campbell",
    "pet_name": "",
    "rating": 5,
    "date": "2025-12-03",
    "text": "Jonathan is extremely kind and truly cares for each dog that boards with him. From the first time meeting, Jonathan was super professional and walked us through his steps on how he will integrate our dog with other dogs during his stay. Jonathan’s house is super clean and spacious! We received text updates with videos, and photos while we were on vacation. He kept us updated on Ollie’s temperament, food schedule, and bathroom breaks. I would highly recommend Jonathan to other dog owners! We know our dog will be in good hands when staying with Jonathan!",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Elayne Blieden",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-04",
    "text": "Johnny was amazing. He was very attentive and loving towards my pet. While in she was in his care he was very communicative in sending photos and videos constantly. I highly recommend him.",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  },
  {
    "client_name": "Steven Foster",
    "pet_name": "",
    "rating": 5,
    "date": "2025-11-13",
    "text": "So happy to have found such a great dog sitter. My dog was so happy to spend almost 2 weeks here. Great communication and can tell they treat each dog as if it was their own. Would highly recommend to anyone looking for a dog sitter.",
    "image_url": null,
    "created_at": "2025-12-06T00:34:56.585516+00:00",
    "sitter_slug": "johnny-irvine"
  }
]